<template>
  <LoggedInTopNav title="سياسة الخصوصية" :backArrow="true" />
  <div class="prof flex flex-col w-full px-6 gap-8 mt-24 lg:mt-40 pb-24">
    <div
      class="p-6 px-8 bg-white rounded-lg shadow-lg max-w-3xl mx-auto text-black"
    >
      <!-- Header -->
      <h3 class="text-lg font-bold text-center pb-2">
        سياسة الخصوصية لمركز المساندة القانونية
      </h3>

      <!-- Section A: المقدمة -->
      <h4 class="text-xl font-semibold mt-4 mb-2">أ – المقدمة:</h4>
      <p class="mb-4">
        1. في مركز المساندة القانونية، يتم منح أهمية كبيرة لحماية خصوصية
        المستخدمين وضمان سرية وأمان المعلومات الشخصية التي يتم جمعها ومعالجتها
        من خلال التطبيق الخاص بنا. يتم الالتزام بتبني أفضل الممارسات لضمان حماية
        معلومات المستخدمين وعدم مشاركتها مع أي جهة خارجية دون موافقة صريحة.
      </p>
      <p class="mb-4">
        2. توضح سياسة الخصوصية هذه كيفية جمع المعلومات الشخصية واستخدامها
        وحمايتها أثناء استخدام خدماتنا الرقمية. بموافقتك على هذه السياسة عند
        استخدام تطبيقنا أو موقعنا الإلكتروني، فإنك تقر بموافقتك على جمع واستخدام
        والكشف عن بياناتك الشخصية وفقًا لما هو موضح أدناه. وفي حال عدم موافقتك
        على بنود هذه السياسة، يرجى عدم تزويدنا بمعلوماتك الشخصية.
      </p>

      <!-- Section B: حقوق الملكية -->
      <h4 class="text-xl font-semibold mt-4 mb-2">ب – حقوق الملكية:</h4>
      <p class="mb-4">
        1. يتم حماية جميع حقوق التأليف والنشر والعلامات التجارية المتعلقة
        بالمحتوى المقدم من قبل مركز المساندة القانونية وشريكها الاستراتيجي "شركة
        تكامل للخدمات القانونية". يمنع نسخ أو إعادة إنتاج أي محتوى دون الحصول
        على إذن مسبق.
      </p>

      <!-- Section C: جمع المعلومات الشخصية -->
      <h4 class="text-xl font-semibold mt-4 mb-2">
        ج – جمع المعلومات الشخصية:
      </h4>
      <ul class="list-decimal pl-5 mb-4">
        <li>
          المعلومات التي يتم جمعها تشمل تفاصيل الأجهزة المستخدمة (مثل عنوان IP،
          والموقع الجغرافي، ونوع المتصفح).
        </li>
        <li>معلومات حول زيارات المستخدمين لموقعنا أو التطبيق.</li>
        <li>
          المعلومات التي تدخل عند التسجيل أو إنشاء حساب، مثل البريد الإلكتروني.
        </li>
        <li>المعلومات المتعلقة بالخدمات المستخدمة عبر التطبيق أو الموقع.</li>
      </ul>

      <!-- Section D: استخدام المعلومات الشخصية -->
      <h4 class="text-xl font-semibold mt-4 mb-2">
        د – استخدام المعلومات الشخصية:
      </h4>
      <ul class="list-decimal pl-5 mb-4">
        <li>يتم استخدام المعلومات لإدارة التطبيق والخدمات.</li>
        <li>تخصيص تجربة المستخدم لتلبية احتياجاته.</li>
        <li>إرسال الفواتير والإشعارات، وإدارة المعاملات.</li>
        <li>حماية التطبيق من الاحتيال وتعزيز الأمان.</li>
      </ul>

      <!-- Section E: الكشف عن المعلومات الشخصية -->
      <h4 class="text-xl font-semibold mt-4 mb-2">
        هـ – الكشف عن المعلومات الشخصية:
      </h4>
      <p class="mb-4">
        1. يمكن الكشف عن معلوماتك لأي من موظفينا أو شركائنا بالقدر اللازم لتحقيق
        أغراض الخدمة.
      </p>
      <p class="mb-4">
        2. سيتم الكشف عن المعلومات إذا كان ذلك مطلوبًا بموجب القانون.
      </p>

      <!-- Section F: النقل الدولي للبيانات -->
      <h4 class="text-xl font-semibold mt-4 mb-2">
        و – النقل الدولي للبيانات:
      </h4>
      <p class="mb-4">
        1. قد يتم نقل معلوماتك الشخصية إلى دول أخرى لأغراض المعالجة، وفقًا
        للقوانين المحلية والدولية.
      </p>

      <!-- Section G: الاحتفاظ بالمعلومات الشخصية -->
      <h4 class="text-xl font-semibold mt-4 mb-2">
        ز – الاحتفاظ بالمعلومات الشخصية:
      </h4>
      <p class="mb-4">
        1. يتم الاحتفاظ بالمعلومات الشخصية طالما كان ذلك ضروريًا للأغراض التي
        جمعت من أجلها أو حسبما يتطلب القانون.
      </p>

      <!-- Section H: أمن المعلومات الشخصية -->
      <h4 class="text-xl font-semibold mt-4 mb-2">
        ح – أمن المعلومات الشخصية:
      </h4>
      <p class="mb-4">
        1. يتم اتخاذ جميع التدابير التقنية والتنظيمية لحماية معلوماتك الشخصية من
        الضياع أو إساءة الاستخدام.
      </p>

      <!-- Section I: التعديلات -->
      <h4 class="text-xl font-semibold mt-4 mb-2">ط – التعديلات:</h4>
      <p class="mb-4">
        1. يحتفظ المركز بالحق في تعديل سياسة الخصوصية في أي وقت. سيتم إعلام
        المستخدمين بأي تغييرات تطرأ عليها.
      </p>

      <!-- Section J: حقوقك -->
      <h4 class="text-xl font-semibold mt-4 mb-2">ي – حقوقك:</h4>
      <p class="mb-4">
        1. يحق لك طلب الوصول إلى المعلومات الشخصية التي نحتفظ بها عنك وتحديثها
        أو تصحيحها.
      </p>

      <!-- Section K: ملفات تعريف الارتباط -->
      <h4 class="text-xl font-semibold mt-4 mb-2">م – ملفات تعريف الارتباط:</h4>
      <p class="mb-4">
        1. قد يتم استخدام ملفات تعريف الارتباط لتخصيص وتحسين تجربة المستخدم.
      </p>

      <!-- Section L: حذف الحساب -->
      <h4 class="text-xl font-semibold mt-4 mb-2">ن – حذف الحساب:</h4>
      <p class="mb-4">1. يمكن طلب حذف الحساب من داخل التطبيق.</p>
    </div>
  </div>
  <BottomNav />
</template>
<script setup>
import LoggedInTopNav from "../components/LoggedInTopNav.vue";
import BottomNav from "@/components/BottomNav.vue";
</script>
