<template>
  <LoggedInTopNav title="شروط الاستخدام" :backArrow="true" />
  <div class="prof flex flex-col w-full px-6 gap-8 mt-24 lg:mt-40 pb-24">
    <div
      class="p-6 px-8 bg-white rounded-lg shadow-lg max-w-3xl mx-auto text-black"
    >
      <h3 class="text-lg font-bold text-center pb-2">
        وثيقة التغطية القانونية
        <br />
        لــ "مركز المساندة القانونية"
        <br />
        الشروط والاحكام
      </h3>
      <!-- Modal Header -->
      <h2 class="text-xl font-semibold mb-4 text-center">
        الضوابط والاستثناءات
      </h2>

      <!-- Introduction -->
      <p class="mb-4">
        تتضمن وثيقة التغطية القانونية لمركز المساندة القانونية مجموعة من الضوابط
        والاستثناءات والتي تحدد شروط التغطية القانونية، وتلعب هذه الضوابط
        والاستثناءات دورًا مهمًا في حماية حقوق ومصالح كل من الطرفين.
      </p>

      <!-- First Section: ضوابط استخدام وثيقة المساندة -->
      <h3 class="text-lg font-semibold mb-2">
        أولا: ضوابط استخدام وثيقة المساندة
      </h3>

      <!-- ضوابط استخدام وثيقة التأمين القانوني من قبل المشترك -->
      <h4 class="font-semibold mt-4 mb-2">
        أ/ضوابط استخدام وثيقة التأمين القانوني من قبل المشترك:
      </h4>
      <ul class="list-decimal pl-5 mb-4">
        <li>
          يجب على المشترك قراءة الوثيقة بعناية قبل الاشتراك، وذلك للتأكد من فهمه
          لجميع شروطها وأحكامها.
        </li>
        <li>
          يجب على المشترك التأكد من أن الباقة تغطي المخاطر التي يرغب في تغطيتها
          قانونياً، وذلك لتجنب أي مشكلات في المستقبل.
        </li>
        <li>
          يجب على المشترك التبليغ عن أي تغييرات في بياناته الشخصية، مثل عنوانه
          أو رقم هاتفه، أو كفالته إلى مركز المساندة، وذلك لتجنب أي مشكلات في
          المستقبل.
        </li>
        <li>
          الشفافية والصدق والأمانة والإخلاص ومبدأ حسن النية هو ما يلتزم به
          المشترك في تعاملاته مع خدمات مركز المساندة.
        </li>
        <li>
          يلتزم المشترك بالإفصاح عن كافة المعلومات والبيانات المطلوبة منه من قبل
          المركز.
        </li>
        <li>
          يلتزم المشترك بتقديم كافة المستندات المطلوبة من قبل مركز المساندة
          القانونية وفي الوقت المحدد.
        </li>
        <li>
          يتحمل المشترك جميع الأضرار عن الأخطاء التي تصدر منه والتي تحول دون
          استخدام الوثيقة مثل عدم تقديم المستندات أو الكذب في ذكر وقائع الموضوع
          وغيرها.
        </li>
        <li>
          يجب على المشترك الإبلاغ عن الواقعة القانونية خلال 30 يومًا من تاريخ
          وقوعها.
        </li>
        <li>
          يجب على المشترك التعاون مع مركز المساندة القانونية، والاستجابة
          للتعليمات التي يصدرها سواءً بحضور الجلسات في المحكمة إن استدعى ذلك أو
          عدم حضورها أو تقديم الأدلة وغيرها.
        </li>
      </ul>

      <!-- ضوابط استخدام وثيقة التأمين القانوني من قبل مركز المساندة القانونية -->
      <h4 class="font-semibold mt-4 mb-2">
        ب/ضوابط استخدام وثيقة التأمين القانوني من قبل مركز المساندة القانونية:
      </h4>
      <ul class="list-decimal pl-5 mb-4">
        <li>
          يلتزم مركز المساندة القانونية بحماية خصوصية المشترك والحفاظ على سرية
          جميع المعلومات المتعلقة به، بما في ذلك المعلومات الشخصية والوثائق
          والمستندات.
        </li>
        <li>
          يلتزم مركز المساندة بطلب موافقة المشترك على استخدام بيانات التواصل فقط
          الخاصة به لأغراض تسهيل عمليات التفاعل في ما يخص المشترك من خدمات
          ولغايات التسويق لخدمات المركز لمشاركة أية جديد يصدر عن مركز المساندة
          القانونية حسب قانون حماية البيانات الشخصية في المملكة العربية السعودية
          في 16 سبتمبر 2021  والموافق  التاسع من صفر 1443 هجري (9-2-1443)
        </li>
        <li>
          يستطيع المشترك الغاء الموافقة على مشاركة البيانات مع المركز في حالة
          عدم رغبته بذلك من خلال العديد من الوسائل ( الاتصال على المركز ،   من
          خلال حساب المشترك في بوابة المستخدم الخاصة بالنظام الالكتروني للمركز
          ،من خلال ارسال رسالة واتس اب او رسالة نصية للرقم الرسمي المعتمد للمركز
          ) كما ينص عليه قانون حماية البيانات الشخصية في المملكة العربية
          السعودية .
        </li>
        <li>
          يلتزم مركز المساندة القانونية من خلال الموقع الالكتروني بإظهار اشعار
          الخصوصية للزوار لإخطارهم باستخدم ملفات تعريف الإرتباط بغرض جمع
          بياناتهم والحصول على موافقتهم (الضمنية أو الصريحة) بمعالجتها وفقا لما
          ينص عليه قانون حماية البيانات الشخصية في المملكة العربية السعودية .
        </li>
        <li>
          يلتزم مركز المساندة القانونية بالمعايير المهنية والأخلاقية في تقديم
          باقات من الخدمات القانونية.
        </li>
        <li>
          الالتزام بتقديم الحماية القانونية للمشترك حسب الباقة في حالة وقوع
          واقعة قانونية خلال فترة الاشتراك، وذلك وفقًا لشروط الوثيقة.
        </li>
        <li>
          يمكن للمركز تقديم خدمات قانونية إضافية مع فرض رسوم إضافية على المشترك
          في حالة تقديم المساعدة القانونية خارج حدود التغطية المحددة في الوثيقة.
        </li>
        <li>
          يلتزم مركز المساندة القانونية بإخطار المشترك بجميع الإجراءات القانونية
          التي سيتم اتخاذها في شأن الواقعة القانونية.
        </li>
        <li>
          يلتزم مركز المساندة القانونية بإبلاغ المشترك بكافة التطورات المتعلقة
          بالواقعة القانونية.
        </li>
        <li>
          يلتزم المركز بتقديم أفضل باقات من الخدمات القانونية للمشتركين،
          وبالتحسين المستمر لجودة باقات من الخدمات القانونية المقدمة.
        </li>
        <li>
          يلتزم مركز المساندة القانونية بالرد على استفسارات المشتركين في أسرع
          وقت ممكن.
        </li>
        <li>
          يلتزم مركز المساندة القانونية بتوفير المعلومات القانونية للمشتركين
          بشكل واضح ومفهوم.
        </li>
        <li>
          يلتزم مركز المساندة القانونية باحترام حقوق المشتركين وعدم التمييز
          بينهم.
        </li>
      </ul>

      <!-- استثناءات -->
      <h3 class="text-lg font-semibold mb-2">الاستثناءات:</h3>
      <ul class="list-decimal pl-5 mb-4">
        <li>الدعاوى المتعلقة بالجانب السياسي وأمن الدولة.</li>
        <li>
          الدعاوى المتعلقة بالأنشطة غير المشروعة مثل قضايا الإرهاب والمقامرة
          والمخدرات وجرائم الإخلال بالأمن.
        </li>
        <li>
          الدعاوى المخالفة للقوانين والأنظمة والتي قد تم إشعار العميل بها من
          خلال مركز المساندة القانونية.
        </li>
        <li>
          الدعاوى المتعلقة بالقوى القاهرة والظروف الطارئة مثل (فيروس كورونا
          المستجد، الزلازل، البراكين).
        </li>
        <li>
          طلبات الخدمة القانونية الفردية (خارج الباقة) التي تم رفعها قبل تاريخ
          الاشتراك بالباقة.
        </li>
        <li>الواقعة القانونية التي وقعت قبل تاريخ البدء في سريان الوثيقة.</li>
        <li>
          الواقعة القانونية التي وقعت خارج نطاق التغطية المحددة في الوثيقة.
        </li>
        <li>
          الدعاوى الصورية التي تستند إلى عقد ظاهر وحقائق خفية تم الاتفاق عليها
          مسبقاً.
        </li>
        <li>
          الدعاوى الكيدية التي لا تستند إلى أي أساس قانوني أو واقعي، وإنما ترفع
          بهدف الإضرار بالخصم.
        </li>
        <li>
          في حال عدم تعاون المشترك في تقديم المستندات المطلوبة، أو في حال عدم
          وجود مبررات قانونية أو إذا كان المشترك قد ارتكب أي خطأ أو إهمال أدى
          إلى وقوع الواقعة القانونية.
        </li>
        <li>
          في حال وجود قوة قاهرة وظروف طارئة مثل (فيروس كورونا المستجد، الزلازل،
          البراكين) فإن تقديم بعض أو جميع خدمات مركز المساندة قد يتقيد ويتبع في
          ذلك إجراءات وقوانين جراءها.
        </li>
      </ul>

      <!-- الشروط العامة -->
      <h3 class="text-lg font-semibold mb-2">الشروط العامة</h3>
      <p class="mb-4">
        تتضمن وثيقة التغطية القانونية مجموعة من الشروط العامة التي تحدد الحقوق
        والالتزامات لكل من المشترك ومركز المساندة، وتلعب هذه الشروط دورًا مهمًا
        في تنظيم العلاقة بين الطرفين، وفيما يلي الشروط العامة للتغطية القانونية
        في مركز المساندة القانونية:
      </p>

      <ul class="list-decimal pl-5 mb-4 space-y-2">
        <li>
          يقدم مركز المساندة القانونية خدماته القانونية لجميع المواطنين
          والمقيمين في المملكة العربية السعودية.
        </li>
        <li>
          يتم تغطية المشترك بالخدمات التي يقدمها مركز المساندة القانونية للطلبات
          التي تنشأ بعد الاشتراك وخلال الاشتراك حسب باقة المشترك.
        </li>
        <li>
          يبدأ سريان الاشتراك من تاريخ التفعيل وتكون مدة سريان الاشتراك سنة
          ميلادية كاملة.
        </li>
        <li>
          ينتهي تلقائيًا سريان مفعول الوثيقة والخدمات المقدمة بموجبها في حالات
          محددة مثل انتهاء مدة الوثيقة أو وفاة المشترك.
        </li>
        <li>
          في حال انتهاء الاشتراك في الباقة مع وجود طلب قائم وقيد التنفيذ، يتم
          تمديد الاشتراك لمدة (5) أيام حتى يتم سداد رسوم التجديد للباقة.
        </li>
        <li>
          يسدد قيمة الاشتراك لأول مرة قبل تفعيل الوثيقة مباشرة، ثم تدفع سنويا في
          نفس الموعد.
        </li>
        <li>
          في حال رغبة المشترك في ترقية الباقة إلى أخرى خلال فترة سريان الاشتراك،
          يمكن الترقية وفقًا لحالات محددة.
        </li>
        <li>
          الوثيقة غير قابلة للإلغاء أثناء سريانها من قبل المشترك إلا في حالات
          محددة.
        </li>
        <li>
          يلتزم مركز المساندة بالاحتفاظ بالسجلات الخاصة بالمشتركين والتي توضح
          الخدمات المقدمة لهم لمدة خمس سنوات من تاريخ انتهاء سريان مدة الاشتراك
          السنوي.
        </li>
        <li>
          القائم بالاشتراك هو المستفيد نفسه، والانتفاع من الوثيقة ليس قابلاً
          للانتقال أو التنازل عنه لأي طرف آخر.
        </li>
      </ul>
    </div>
  </div>

  <BottomNav />
</template>
<script setup>
import LoggedInTopNav from "../components/LoggedInTopNav.vue";
import BottomNav from "@/components/BottomNav.vue";
</script>
